TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/stm32wba/sid_sbdt_demo/STM32_WPAN/App/app_sidewalk.c
/**
  ******************************************************************************
  * @file    app_sidewalk.c
  * @brief   Standardized Sidewalk Bulk Data Transfer (SBDT) demo app
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

 /* Includes ------------------------------------------------------------------*/

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "app_freertos.h"

#include <sid_application_install_manager_ifc.h>
#include <sid_api.h>
#include <sid_app_sbdt_demo.h>
#include <sid_log_control.h>
#include <sid_hal_reset_ifc.h>
#include <sid_pal_assert_ifc.h>
#include <sid_pal_common_ifc.h>
#include <sid_pal_gpio_ifc.h>
#include <sid_pal_log_ifc.h>
#include <sid_pal_timer_ifc.h>
#include <sid_pal_uptime_ifc.h>
#include <sid_time_ops.h>

#include SID_APP_VERSION_HEADER
#include <sid_sdk_version.h>

#include "target/memory.h"

#include "app_ble_config.h"
#include "app_common.h"
#include <stm32_mcu_info.h>
#if CFG_LED_SUPPORTED
#  include "led_indication.h"
#endif
#include "sid_pal_gpio_ext_ifc.h"
#if defined(NUCLEO_WBA52_BOARD) || defined(NUCLEO_WBA55_BOARD) || defined (NUCLEO_WBA65_BOARD)
#  include "stm32wbaxx_nucleo.h"
#endif

#if (CFG_LPM_LEVEL != 0)
#  include "stm32_lpm.h"
#endif /* (CFG_LPM_LEVEL != 0) */
#if (CFG_BUTTON_SUPPORTED != 0) && (CFG_LPM_STDBY_SUPPORTED != 0)
#  include <sid_pal_gpio_ext_ifc.h>
#endif /* (CFG_BUTTON_SUPPORTED != 0) && (CFG_LPM_STDBY_SUPPORTED != 0) */

/* Private defines -----------------------------------------------------------*/

#if (CFG_BUTTON_SUPPORTED != 0)
#  define BUTTON_LONG_PRESS_MS                (1500u)
#  define DEMO_FACTORY_RESET_BUTTON_ID        (0u)
#  define DEMO_CONNECT_LINK_TYPE_1_BUTTON_ID  (1u)
#  define DEMO_SEND_MESSAGE_BUTTON_ID         (2u)
#  define DEMO_SBDT_CANCEL_TRANSFER_BUTTON_ID (3u)
#endif /* CFG_BUTTON_SUPPORTED */

#define FLASH_WORD_SIZE                       (16u) /* in bytes */
#define ALIGN_TO_FLASH_WORD_BOUNDARY(_VALUE_) ((((size_t)(_VALUE_) + (FLASH_WORD_SIZE - 1u)) / FLASH_WORD_SIZE) * FLASH_WORD_SIZE)

#define SBDT_DEMO_LOG_PREFIX                  "SBDT: "

#define SBDT_DEMO_DFU_RESET_DELAY_S           (5u)

/* Private macro -------------------------------------------------------------*/

#define OS_MS_TO_TICKS( xTimeInMs )    ( ( uint32_t ) ( ( ( uint32_t ) ( xTimeInMs ) * ( uint32_t ) osKernelGetTickFreq() ) / ( uint32_t ) 1000U ) )

/* Private typedef -----------------------------------------------------------*/

typedef __PACKED_UNION {
    __PACKED_STRUCT {
        uint8_t build;
        uint8_t patch;
        uint8_t minor;
        uint8_t major;
    };
    uint32_t raw;
} hal_version_info_t;

/* Private variables ---------------------------------------------------------*/

static struct sid_event_callbacks * sbdt_demo_callbacks;
static struct sid_event_callbacks   sbdt_demo_callback_wrappers;

static sid_pal_timer_t              reset_delay_timer;

/* Private constants ---------------------------------------------------------*/

static const osThreadAttr_t sidewalk_stack_task_attributes = {
    .name         = "Sidewalk Stack Task",
    .priority     = SID_MAIN_TASK_PRIO,
    .stack_size   = SID_MAIN_TASK_STACK_SIZE,
    .attr_bits    = TASK_DEFAULT_ATTR_BITS,
    .cb_mem       = TASK_DEFAULT_CB_MEM,
    .cb_size      = TASK_DEFAULT_CB_SIZE,
    .stack_mem    = TASK_DEFAULT_STACK_MEM,
};

/* Declare the necessary data structures to interface with the Application Install Manager (e.g., image header, footer, etc.) */
SID_AIM_IFC_DECLARE_OTA_METADATA();

/* Private function prototypes -----------------------------------------------*/

static void        on_sidewalk_msg_received(const struct sid_msg_desc *msg_desc, const struct sid_msg *msg, void *context);
static void        on_sidewalk_msg_sent(const struct sid_msg_desc *msg_desc, void *context);
static void        on_sidewalk_send_error(sid_error_t error, const struct sid_msg_desc *msg_desc, void *context);
static void        on_sidewalk_status_changed(const struct sid_status *status, void *context);
static uint32_t    crc32_compute(const uint8_t * const data, const uint32_t size, const uint32_t * const prev_crc);
static void        reset_delay_timer_cb(void *cookie, sid_pal_timer_t *originator);
static void        trigger_delayed_dfu_reset(void);
static void        platform_reset(void);
static void        platform_flash_init(void);
static uint32_t    platform_flash_get_free_space(void);
static bool        platform_flash_write(uint32_t offset, void *data, size_t size);
static bool        platform_flash_check(uint32_t size, uint32_t expected_crc);
static bool        platform_flash_finalize(uint32_t size, uint32_t crc);
static sid_error_t init_and_start_link(app_context_t * const context, struct sid_config * const config);

#if (CFG_BUTTON_SUPPORTED == 1)
static void button1_irq_handler(uint32_t pin, void * callback_arg);
static void button2_irq_handler(uint32_t pin, void * callback_arg);
static void button3_irq_handler(uint32_t pin, void * callback_arg);
#endif

static void sidewalk_stack_task_entry(void *context);

/* Private function definitions ----------------------------------------------*/

static void on_sidewalk_msg_received(const struct sid_msg_desc *msg_desc, const struct sid_msg *msg, void *context)
{
#if CFG_LED_SUPPORTED
    (void)led_indication_set(LED_INDICATE_RCV_OK);
#endif

    /* Invoke the original callback */
    if (sbdt_demo_callbacks->on_msg_received != NULL)
    {
        sbdt_demo_callbacks->on_msg_received(msg_desc, msg, context);
    }
}

/*----------------------------------------------------------------------------*/

static void on_sidewalk_msg_sent(const struct sid_msg_desc *msg_desc, void *context)
{
#if CFG_LED_SUPPORTED
    (void)led_indication_set(LED_INDICATE_SENT_OK);
#endif

    /* Invoke the original callback */
    if (sbdt_demo_callbacks->on_msg_sent != NULL)
    {
        sbdt_demo_callbacks->on_msg_sent(msg_desc, context);
    }
}

