TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/stm32wba/sid_sbdt_demo/STM32_WPAN/App/app_sidewalk.c
/*----------------------------------------------------------------------------*/

static void on_sidewalk_send_error(sid_error_t error, const struct sid_msg_desc *msg_desc, void *context)
{
#if CFG_LED_SUPPORTED
    (void)led_indication_set(LED_INDICATE_SEND_ERROR);
#endif

    /* Invoke the original callback */
    if (sbdt_demo_callbacks->on_send_error != NULL)
    {
        sbdt_demo_callbacks->on_send_error(error, msg_desc, context);
    }
}

/*----------------------------------------------------------------------------*/

static void on_sidewalk_status_changed(const struct sid_status *status, void *context)
{
    switch (status->state)
    {
        case SID_STATE_READY:
#if CFG_LED_SUPPORTED
            (void)led_indication_set(LED_INDICATE_CONNECTED);
#endif
            /* Mark current app as verified after the successful connection to the Sidewalk network */
            (void)sid_aim_ifc_confirm_app_is_verified();
            break;

        case SID_STATE_NOT_READY:
#if CFG_LED_SUPPORTED
            (void)led_indication_set(LED_INDICATE_BONDING);
#endif
            break;

        case SID_STATE_ERROR:
#if CFG_LED_SUPPORTED
            (void)led_indication_set(LED_INDICATE_ERROR);
#endif
            break;

        default:
            /* Do nothing about it */
            break;
    }

    /* Invoke the original callback */
    if (sbdt_demo_callbacks->on_status_changed != NULL)
    {
        sbdt_demo_callbacks->on_status_changed(status, context);
    }
}

/*----------------------------------------------------------------------------*/

static uint32_t crc32_compute(const uint8_t * const data, const uint32_t size, const uint32_t * const prev_crc)
{
    uint32_t crc;

    crc = (prev_crc == NULL) ? 0xFFFFFFFFu : ~(*prev_crc);

    for (uint32_t i = 0u; i < size; i++)
    {
        crc = crc ^ data[i];
        for (uint32_t j = 8u; j > 0u; j--)
        {
            crc = (crc >> 1) ^ (0xEDB88320u & ((crc & 1u) ? 0xFFFFFFFFu : 0u));
        }
    }

    crc = ~crc;
    return crc;
}

/*----------------------------------------------------------------------------*/

static void reset_delay_timer_cb(void *cookie, sid_pal_timer_t *originator)
{
    (void)cookie;
    (void)originator;

    sid_hal_reset(SID_HAL_RESET_DFU);
}

/*----------------------------------------------------------------------------*/

static void trigger_delayed_dfu_reset(void)
{
    struct sid_timespec now = {};
    struct sid_timespec sid_tsec = {
        .tv_sec  = SBDT_DEMO_DFU_RESET_DELAY_S,
        .tv_nsec = 0u,
    };

    sid_pal_uptime_now(&now);
    sid_time_add(&now, &sid_tsec);
    sid_pal_timer_arm(&reset_delay_timer, SID_PAL_TIMER_PRIO_CLASS_PRECISE, &now, NULL);

    SID_PAL_LOG_INFO("Scheduled reboot to start update via Application Install Manager");
}

/*----------------------------------------------------------------------------*/

static void platform_reset(void)
{
    sid_hal_reset(SID_HAL_RESET_NORMAL);
}

/*----------------------------------------------------------------------------*/

static void platform_flash_init(void)
{
    sid_error_t err;

    SID_PAL_ASSERT((APP_CONFIG_AIM_STAGING_SLOT_START - FLASH_BASE) % FLASH_PAGE_SIZE == 0u);

    err = sid_pal_timer_init(&reset_delay_timer, reset_delay_timer_cb, NULL);
    if (err != SID_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR(SBDT_DEMO_LOG_PREFIX "Failed to initialize reset delay timer. Error: %d", (int32_t)err);
    }

    err = sid_aim_ifc_init();
    if (err != SID_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR(SBDT_DEMO_LOG_PREFIX "Failed to initialize AIM interface. Error: %d", (int32_t)err);
    }
}

/*----------------------------------------------------------------------------*/

static uint32_t platform_flash_get_free_space(void)
{
    uint32_t free_bytes = APP_CONFIG_AIM_STAGING_SLOT_SIZE;
    return free_bytes;
}

/*----------------------------------------------------------------------------*/

static bool platform_flash_write(uint32_t offset, void *data, size_t size)
{
    bool success = false;
    const uint32_t write_start_addr = APP_CONFIG_AIM_STAGING_SLOT_START + offset;

    do
    {
        sid_error_t err;

        err = sid_aim_ifc_store_ota_data_chunk(data, offset, size);
        if (err != SID_ERROR_NONE)
        {
            SID_PAL_LOG_INFO(SBDT_DEMO_LOG_PREFIX "Failed to store %u bytes at address 0x%08X. Error %d", size, write_start_addr, (int32_t)err);
            break;
        }

        SID_PAL_LOG_INFO(SBDT_DEMO_LOG_PREFIX "%u bytes written to address 0x%08X", size, write_start_addr);
        success = true;
    } while (0);

    return success;
}

/*----------------------------------------------------------------------------*/

static bool platform_flash_check(uint32_t size, uint32_t expected_crc)
{
    const uint32_t calculated_crc = crc32_compute((uint8_t *)(void *)APP_CONFIG_AIM_STAGING_SLOT_START, size, NULL);
    SID_PAL_LOG_INFO(SBDT_DEMO_LOG_PREFIX "calculated CRC: 0x%08X, expected: 0x%08X, length = %u", calculated_crc, expected_crc, size);
    return calculated_crc == expected_crc;
}

/*----------------------------------------------------------------------------*/

static bool platform_flash_finalize(uint32_t size, uint32_t crc)
{
    SID_PAL_LOG_INFO(SBDT_DEMO_LOG_PREFIX "OTA image received. Scheduling MCU reset in %u seconds", SBDT_DEMO_DFU_RESET_DELAY_S);

    /* Release AIM interface resources */
    (void)sid_aim_ifc_deinit();

    /* Schedule DFU reset */
    trigger_delayed_dfu_reset();
    return true;
}

/*----------------------------------------------------------------------------*/

static sid_error_t init_and_start_link(app_context_t * const context, struct sid_config * const config)
{
    sid_error_t ret = SID_ERROR_GENERIC;
    struct sid_handle *sid_handle = NULL;

    /* Validate inputs */
    if (NULL == context)
    {
        SID_PAL_LOG_ERROR("Sidewalk context cannot be null");
        ret = SID_ERROR_NULL_POINTER;
        goto error;
    }

    if (NULL == config)
    {
        SID_PAL_LOG_ERROR("Sidewalk config cannot be null");
        ret = SID_ERROR_NULL_POINTER;
        goto error;
    }

