TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/stm32wba/sid_sbdt_demo/STM32_WPAN/App/app_sidewalk.c
    /* Make sure Sidewalk is not initialized already */
    if (context->sidewalk_handle != NULL)
    {
        SID_PAL_LOG_ERROR("Sidewalk is initialized already");
        ret = SID_ERROR_ALREADY_INITIALIZED;
        goto error;
    }

    /* Initialize Sidewalk */
    ret = sid_init(config, &sid_handle);
    if (ret != SID_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to initialize Sidewalk stack, link_mask:%x, err:%d", (int)config->link_mask, (int)ret);
        goto error;
    }

    /* Register sidewalk handle to the application context */
    context->sidewalk_handle = sid_handle;

    /* Start the Sidewalk stack with the selected link type */
    ret = sid_start(sid_handle, config->link_mask);
    if (ret != SID_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to start Sidewalk stack, link_mask:%x, err:%d", (int)config->link_mask, (int)ret);
        goto error;
    }

    return ret;

error:
    context->sidewalk_handle = NULL;
    config->link_mask = 0;
    return ret;
}

/*----------------------------------------------------------------------------*/

#if (CFG_BUTTON_SUPPORTED == 1)
static void button1_irq_handler(uint32_t pin, void * callback_arg)
{
    static uint32_t uStart = 0u;
    static uint32_t uEnd   = 0u;
    uint8_t pinState;
    sid_error_t ret;

    (void)callback_arg;

    ret = sid_pal_gpio_read(pin, &pinState);
    if (SID_ERROR_NONE == ret)
    {
        if (GPIO_PIN_RESET == pinState)
        {
            uStart = osKernelGetTickCount();
        }
        else
        {
            uEnd = osKernelGetTickCount();

            if ((uEnd - uStart) < OS_MS_TO_TICKS(BUTTON_LONG_PRESS_MS))
            {
                /* Short-press event */
                demo_app_button_event_handler(DEMO_SBDT_CANCEL_TRANSFER_BUTTON_ID);
            }
            else
            {
                /* Long-press event */
                demo_app_button_event_handler(DEMO_FACTORY_RESET_BUTTON_ID);
            }
        }
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to read B1 state. Error %d", (int32_t)ret);
    }
}

/*----------------------------------------------------------------------------*/

static void button2_irq_handler(uint32_t pin, void * callback_arg)
{
    (void)pin;
    (void)callback_arg;

    demo_app_button_event_handler(DEMO_CONNECT_LINK_TYPE_1_BUTTON_ID);
}

/*----------------------------------------------------------------------------*/

static void button3_irq_handler(uint32_t pin, void * callback_arg)
{
#  if defined(SID_RADIO_PLATFORM_LR11XX) || defined(SID_RADIO_PLATFORM_SX126X) /* Semtech shields occupy B2 GPIO pin for BUSY signal, use extra-long B3 press instead */
    static uint32_t uStart = 0u;
    static uint32_t uEnd   = 0u;
    uint8_t pinState;
    sid_error_t ret;

    (void)callback_arg;

    ret = sid_pal_gpio_read(pin, &pinState);
    if (SID_ERROR_NONE == ret)
    {
        if (GPIO_PIN_RESET == pinState)
        {
            uStart = osKernelGetTickCount();
        }
        else
        {
            uEnd = osKernelGetTickCount();

            if ((uEnd - uStart) >= (4u * OS_MS_TO_TICKS(BUTTON_LONG_PRESS_MS)))
            {
                /* Extra-long-press event */
                demo_app_button_event_handler(DEMO_CONNECT_LINK_TYPE_1_BUTTON_ID);
            }
            else
            {
                /* Short-press event */
                demo_app_button_event_handler(DEMO_SEND_MESSAGE_BUTTON_ID);
            }
        }
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to read B3 state. Error %d", (int32_t)ret);
    }
#  else
    (void)pin;
    (void)callback_arg;

    demo_app_button_event_handler(DEMO_SEND_MESSAGE_BUTTON_ID);
#  endif /* SID_RADIO_PLATFORM_LR11XX || SID_RADIO_PLATFORM_SX126X */
}
#endif /* CFG_BUTTON_SUPPORTED */

/*----------------------------------------------------------------------------*/

static void sidewalk_stack_task_entry(void *context)
{
    app_context_t *app_context = (app_context_t *)context;
    sid_error_t ret;

    struct sid_end_device_characteristics dev_ch = {
        .type = SID_END_DEVICE_TYPE_STATIC,
        .power_type = SID_END_DEVICE_POWERED_BY_BATTERY_AND_LINE_POWER,
        .qualification_id = 0x0001u,
    };

    /* Get function pointers to the original event callbacks of the unified demo app */
    sbdt_demo_callbacks = demo_app_get_sid_event_callbacks();

    /* Pre-populate event callback wrappers with original function pointers */
    sbdt_demo_callback_wrappers = *sbdt_demo_callbacks;

    /* Inject event callback wrappers where needed */
    sbdt_demo_callback_wrappers.on_msg_received   = on_sidewalk_msg_received;
    sbdt_demo_callback_wrappers.on_msg_sent       = on_sidewalk_msg_sent;
    sbdt_demo_callback_wrappers.on_send_error     = on_sidewalk_send_error;
    sbdt_demo_callback_wrappers.on_status_changed = on_sidewalk_status_changed;

    struct sid_config config = {
        .link_mask = SID_LINK_TYPE_1,
        .dev_ch = dev_ch,
        .callbacks = &sbdt_demo_callback_wrappers,
        .link_config = app_get_sidewalk_ble_config(),
        .sub_ghz_link_config = NULL,
    };

    /* Start Sidewalk link */
    ret = init_and_start_link(app_context, &config);
    if (ret != SID_ERROR_NONE)
    {
        goto error;
    }

    while (1)
    {
        struct app_demo_event event;

        if (osMessageQueueGet(app_context->event_queue, &event, NULL, osWaitForever) == osOK)
        {
            /* Call unified event processor */
            demo_app_main_task_event_handler(&event);
        }
    }

error:
    if (app_context->sidewalk_handle != NULL)
    {
        sid_stop(app_context->sidewalk_handle, SID_LINK_TYPE_1);
        sid_deinit(app_context->sidewalk_handle);
        app_context->sidewalk_handle = NULL;
    }

#if CFG_LED_SUPPORTED
    (void)led_indication_set(LED_INDICATE_OFF);
#endif

    SID_PAL_LOG_INFO("Sidewalk SBDT demo terminated due to error");
    Error_Handler();

    osThreadExit(); /* Normally this line is not reachable, but keep it if Error_Handler somehow returns */
}

/* Global function definitions -----------------------------------------------*/

void SID_APP_Init(void)
{
    /* Adjust Sidewalk log level dynamically - this is needed if the firmware is compiled using
     * Sidewalk SDK static library and the library was assembled with different debug level
     */
    struct sid_log_control_severity sid_log_settings;
    sid_log_control_get_severity(&sid_log_settings);
    if (SID_PAL_LOG_LEVEL != sid_log_settings.level)
    {
        sid_log_settings.level = SID_PAL_LOG_LEVEL;
        sid_log_control_set_severity(&sid_log_settings);
    }

    /* Printout application version info */
    SID_PAL_LOG_INFO("Application name: %s", SID_APP_PROJECT_NAME);
    SID_PAL_LOG_INFO("Application version %s", SID_APP_PROJECT_VERSION_STRING);
    SID_PAL_LOG_INFO("Application build type: %s", SID_APP_PROJECT_BUILD_TYPE);
    SID_PAL_LOG_INFO("Application commit hash: %s", SID_APP_PROJECT_COMMIT_HASH_STRING);
    SID_PAL_LOG_INFO("Application commit description: %s", SID_APP_PROJECT_COMMIT_DESCRIPTION);
    SID_PAL_LOG_INFO("Sidewalk SDK: %u.%u.%u-%u", SID_SDK_MAJOR_VERSION, SID_SDK_MINOR_VERSION, SID_SDK_PATCH_VERSION, SID_SDK_BUILD_VERSION);
    SID_PAL_LOG_INFO("FreeRTOS Kernel: %s", tskKERNEL_VERSION_NUMBER);

